//
//  main.c
//  字符串
//
//  Created by ZHAO on 2019/10/31.
//  Copyright © 2019 123. All rights reserved.
//



/*
 
 只出现一次的字符：
 思路：运用map或者数组进行计数。
 
 &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
 
 翻转字符串：
 
 先全部翻转，然后逐个翻转。
 
 &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
 
 左旋转字符串：
 字符串旋转，替换。
 
 &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
 
 把字符串转换成整数：
 
 运用ascii码。
 
 &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
 
 字符串排序：
 
 
 
 
 */

#include <stdio.h>




int main(int argc, const char * argv[]) {
    // insert code here...
    printf("Hello, World!\n");
    return 0;
}
